In [1]:
customer_data = [
    [1, 'Ella','emily@example.com'],
    [2, 'david','michael@example.com'],
    [3, 'zachary','sarah@example.com'],
    [4, 'alice','john@example.com'],
    [5, 'finn','john@example.com'],
    [6, 'violet','alice@example.com']
]

In [3]:
import pandas as pd

In [5]:
customer_data_columns = ['customer id','name','email']

In [9]:
df = pd.DataFrame(data=customer_data, columns=customer_data_columns)

In [11]:
df

   customer id     name                email
0            1     Ella    emily@example.com
1            2    david  michael@example.com
2            3  zachary    sarah@example.com
3            4    alice     john@example.com
4            5     finn     john@example.com
5            6   violet    alice@example.com

In [15]:
df.drop_duplicates(subset='email', inplace=True)

In [17]:
df

   customer id     name                email
0            1     Ella    emily@example.com
1            2    david  michael@example.com
2            3  zachary    sarah@example.com
3            4    alice     john@example.com
5            6   violet    alice@example.com

## ^checkpoint:
`.drop_duplicates()` removes the rows with repeated occurances of a value. 
`.drop_duplicates()` takes in the `subset=` which is the column you want to drop duplicates for and `inplace=true` will make sure that the filtering happens on your original table.

In [20]:
student_data = [
    [1, 'Ella','emily@example.com'],
    [2, 'david','michael@example.com'],
    [3, None,'sarah@example.com'],
    [4, 'alice','john@example.com'],
    [5, None,'john@example.com'],
    [6, 'violet','alice@example.com']
]

In [22]:
student_data_columns=['student id','name','email']

In [24]:
df2=pd.DataFrame(data=student_data, columns=student_data_columns)

In [26]:
df2

   student id    name                email
0           1    Ella    emily@example.com
1           2   david  michael@example.com
2           3    None    sarah@example.com
3           4   alice     john@example.com
4           5    None     john@example.com
5           6  violet    alice@example.com

# ^checkpoint 
`.dropna()` used to remove the rows that have no values for a certain column